Table of Contents
 Class IdeaAnchorGrid
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaAnchorGrid : AbstractIdeaObject<IIdeaAnchorGrid>, IEquatable<AbstractIdeaObject<IIdeaAnchorGrid>>, IIdeaAnchorGrid, IIdeaBoltGrid, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaAnchorGrid>
IdeaAnchorGrid
Implements
IEquatable<AbstractIdeaObject<IIdeaAnchorGrid>>
IIdeaAnchorGrid
IIdeaBoltGrid
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaAnchorGrid>.Id
 AbstractIdeaObject<IIdeaAnchorGrid>.Name
 AbstractIdeaObject<IIdeaAnchorGrid>.Identifier
 AbstractIdeaObject<IIdeaAnchorGrid>.GetHashCode()
 AbstractIdeaObject<IIdeaAnchorGrid>.Equals(object)
 AbstractIdeaObject<IIdeaAnchorGrid>.Equals(AbstractIdeaObject<IIdeaAnchorGrid>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaAnchorGrid(Identifier<IIdeaAnchorGrid>)
protected IdeaAnchorGrid(Identifier<IIdeaAnchorGrid> identifer)
Parameters
identifer Identifier<IIdeaAnchorGrid>
 IdeaAnchorGrid(int)
public IdeaAnchorGrid(int id)
Parameters
id int
 IdeaAnchorGrid(string)
public IdeaAnchorGrid(string id)
Parameters
id string
Properties
 AnchorType
Anchor Type
public AnchorType AnchorType { get; set; }
Property Value
AnchorType
 BoltAssembly
Bolt Assembly
public IIdeaBoltAssembly BoltAssembly { get; set; }
Property Value
IIdeaBoltAssembly
 BoltShearType
Defines a transfer of shear force in bolts.
public BoltShearType BoltShearType { get; set; }
Property Value
BoltShearType
 ConcreteBlock
Concrete Block
public IIdeaConcreteBlock ConcreteBlock { get; set; }
Property Value
IIdeaConcreteBlock
 ConnectedParts
Collection of parf witch shoud be bolted
public IEnumerable<IIdeaObjectConnectable> ConnectedParts { get; set; }
Property Value
IEnumerable<IIdeaObjectConnectable>
 LocalCoordinateSystem
Local Coordinate System (LCS) of the bolt grid. Only vector definition of the LCS is supported, so the instance of IdeaRS.OpenModel.Geometry3D.CoordSystemByVector must be returned. LCS only effects rotation of the segment, it does not modify on nodes' position.
public CoordSystem LocalCoordinateSystem { get; set; }
Property Value
CoordSystem
 Origin
Origin node of the bolt grid.
public virtual IIdeaNode Origin { get; set; }
Property Value
IIdeaNode
 Positions
Collection of nodes specific position of the bolt
public IEnumerable<IIdeaNode> Positions { get; set; }
Property Value
IEnumerable<IIdeaNode>
 ShearInThread
Shear in thread
public bool ShearInThread { get; set; }
Property Value
bool
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 WasherSize
Washer Size
public double WasherSize { get; set; }
Property Value
double
 Edit this page